In [45]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt

In [46]:
import numpy as np
import pandas as pd
import datetime as dt

In [47]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
import sqlite3
import psycopg2

In [48]:
conn = sqlite3.connect("FPA_FOD_20170508.sqlite")

In [49]:
c = conn.cursor()
sqlSTMT = f'select FIRE_NAME,FIRE_YEAR,date(DISCOVERY_DATE),DISCOVERY_DOY,DISCOVERY_TIME,STAT_CAUSE_CODE,STAT_CAUSE_DESCR,date(CONT_DATE),CONT_DOY,CONT_TIME,FIRE_SIZE,FIRE_SIZE_CLASS,LATITUDE,LONGITUDE,OWNER_CODE,OWNER_DESCR,STATE,COUNTY,FIPS_CODE,FIPS_NAME from Fires WHERE STATE="CA";'
newdf = []
for x in c.execute(sqlSTMT):
    newdf.append(x)

In [50]:
df_fire= pd.DataFrame(newdf)
df_fire_sort = df_fire.sort_values(by=1,ascending=True)

In [51]:
df_fire_sort.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
40457,GRINDER,1992,1992-04-07,98,1420,5.0,Debris Burning,1992-04-07,98.0,1510,0.2,A,40.333200,-120.234400,8.0,PRIVATE,CA,None,None,None
8721,None,1992,1992-09-07,251,1330,1.0,Lightning,1992-09-07,251.0,1800,0.1,A,41.530000,-122.161667,13.0,STATE OR PRIVATE,CA,None,None,None
8722,None,1992,1992-10-02,276,1000,1.0,Lightning,1992-10-02,276.0,1030,0.1,A,41.558333,-122.065000,13.0,STATE OR PRIVATE,CA,None,None,None
8723,None,1992,1992-10-07,281,1730,7.0,Arson,1992-10-08,282.0,1600,3.0,B,41.888333,-122.238333,13.0,STATE OR PRIVATE,CA,None,None,None
8724,None,1992,1992-10-27,301,1500,1.0,Lightning,1992-10-27,301.0,1800,0.1,A,41.705000,-121.931667,5.0,USFS,CA,None,None,None

In [52]:
# Extract desired columns from the California only fire data frame in the order desired
# new_df_fire = df_fire[[0, 2, 3, 5, 6, 8, 10, 16]]
new_df_fire = df_fire[[2, 0, 3, 8, 5, 6, 10, 16]]
                           
new_df_fire.head()

           2         0    3      8    5               6     10  16
0  2005-02-02  FOUNTAIN   33   33.0  9.0   Miscellaneous  0.10  CA
1  2004-05-12    PIGEON  133  133.0  1.0       Lightning  0.25  CA
2  2004-05-31     SLACK  152  152.0  5.0  Debris Burning  0.10  CA
3  2004-06-28      DEER  180  185.0  1.0       Lightning  0.10  CA
4  2004-06-28  STEVENOT  180  185.0  1.0       Lightning  0.10  CA

In [53]:
# rename columns
new_df_fire = new_df_fire.rename(
    columns={2: "Fire_Date",
             0: "Fire_Name", 
             3: "Discovery_DOY_in_Julian", 
             8: "Containment_DOY_in_Julian",
             5: "Cause_Code",
             6: "Cause_Description",
             10: "Fire_Size_in_Acres",
             16: "State"})
new_df_fire.head()

,Fire_Date,Fire_Name,Discovery_DOY_in_Julian,Containment_DOY_in_Julian,Cause_Code,Cause_Description,Fire_Size_in_Acres,State
0,2005-02-02,FOUNTAIN,33,33.0,9.0,Miscellaneous,0.10,CA
1,2004-05-12,PIGEON,133,133.0,1.0,Lightning,0.25,CA
2,2004-05-31,SLACK,152,152.0,5.0,Debris Burning,0.10,CA
3,2004-06-28,DEER,180,185.0,1.0,Lightning,0.10,CA
4,2004-06-28,STEVENOT,180,185.0,1.0,Lightning,0.10,CA

In [55]:
# Sort by ascending date
new_df_fire = new_df_fire.sort_values(by='Fire_Date', ascending=True)
new_df_fire.head()

,Fire_Date,Fire_Name,Discovery_DOY_in_Julian,Containment_DOY_in_Julian,Cause_Code,Cause_Description,Fire_Size_in_Acres,State
34267,1992-01-01,VOLCAN 1-5,1,1.0,5.0,Debris Burning,5.0,CA
135389,1992-01-01,LOCAL,1,NaN,8.0,Children,0.2,CA
10455,1992-01-01,CITY,1,1.0,1.0,Lightning,0.1,CA
135391,1992-01-02,LOCAL,2,NaN,8.0,Children,0.1,CA
135390,1992-01-02,STATE,2,NaN,9.0,Miscellaneous,0.5,CA

In [56]:
#Change Date stamp to YYYYMM
new_df_fire['dt'] = [''.join(x.split('-')[0:2]) for x in new_df_fire['Fire_Date']]
new_df_fire.head()

,Fire_Date,Fire_Name,Discovery_DOY_in_Julian,Containment_DOY_in_Julian,Cause_Code,Cause_Description,Fire_Size_in_Acres,State,dt
34267,1992-01-01,VOLCAN 1-5,1,1.0,5.0,Debris Burning,5.0,CA,199201
135389,1992-01-01,LOCAL,1,NaN,8.0,Children,0.2,CA,199201
10455,1992-01-01,CITY,1,1.0,1.0,Lightning,0.1,CA,199201
135391,1992-01-02,LOCAL,2,NaN,8.0,Children,0.1,CA,199201
135390,1992-01-02,STATE,2,NaN,9.0,Miscellaneous,0.5,CA,199201

In [57]:
# Step 1 in removing dates past September 2013 (to line up with the temperature data)
# Convert the date column "dt" from a string to int64

new_df_fire['dt'] = new_df_fire['dt'].values.astype(np.int64)

In [58]:
# Remove data past the last month of temperature date 201309
# Get indexes for which column dt has values greater than 201309
indexDates = new_df_fire[ new_df_fire['dt'] > 201309].index
# Delete these row indexes from dataFrame
new_df_fire.drop(indexDates , inplace=True)

new_df_fire.tail()

,Fire_Date,Fire_Name,Discovery_DOY_in_Julian,Containment_DOY_in_Julian,Cause_Code,Cause_Description,Fire_Size_in_Acres,State,dt
161754,2013-09-30,SUMMIT,273,273.0,7.0,Arson,0.1,CA,201309
186990,2013-09-30,VERBENA,273,273.0,9.0,Miscellaneous,0.1,CA,201309
182777,2013-09-30,CREEK,273,273.0,7.0,Arson,0.1,CA,201309
183271,2013-09-30,LANDERGEN,273,273.0,13.0,Missing/Undefined,8.0,CA,201309
186949,2013-09-30,ELECTRA,273,273.0,7.0,Arson,3.0,CA,201309

In [59]:
# re order columns
new_df_fire = new_df_fire[[
             "dt", 
             "Fire_Date",
             "Fire_Name", 
             "Discovery_DOY_in_Julian",  
             "Containment_DOY_in_Julian",
             "Cause_Code",
             "Cause_Description",
             "Fire_Size_in_Acres",
             "State"]]
new_df_fire.head()

,dt,Fire_Date,Fire_Name,Discovery_DOY_in_Julian,Containment_DOY_in_Julian,Cause_Code,Cause_Description,Fire_Size_in_Acres,State
34267,199201,1992-01-01,VOLCAN 1-5,1,1.0,5.0,Debris Burning,5.0,CA
135389,199201,1992-01-01,LOCAL,1,NaN,8.0,Children,0.2,CA
10455,199201,1992-01-01,CITY,1,1.0,1.0,Lightning,0.1,CA
135391,199201,1992-01-02,LOCAL,2,NaN,8.0,Children,0.1,CA
135390,199201,1992-01-02,STATE,2,NaN,9.0,Miscellaneous,0.5,CA

In [60]:
# Connect to database (Note: The package psychopg2 is required for Postgres to work with SQLAlchemy)
engine = sqlalchemy.create_engine("postgresql://postgres:ASDa372125!@localhost/California_fires")
conn = engine.connect()

In [61]:
table_name = 'fires'
new_df_fire.to_sql(table_name, conn, index=False, if_exists='replace')

In [62]:
print(engine.table_names())

['weather', 'fires']

In [63]:
df_weather=pd.read_csv("GlobalLandTemperaturesByState.csv")
df_weather.head()

           dt  AverageTemperature  AverageTemperatureUncertainty State Country
0  1855-05-01              25.544                          1.171  Acre  Brazil
1  1855-06-01              24.228                          1.103  Acre  Brazil
2  1855-07-01              24.371                          1.044  Acre  Brazil
3  1855-08-01              25.427                          1.073  Acre  Brazil
4  1855-09-01              25.675                          1.014  Acre  Brazil

In [64]:
df_weather = df_weather.rename(columns={"dt":"Date"})

In [65]:
# Filter down to California
df_weather_cali=df_weather.loc[df_weather["State"] == "California",:]
df_weather_cali.head()

,Date,AverageTemperature,AverageTemperatureUncertainty,State,Country
71058,1849-01-01,5.591,2.405,California,United States
71059,1849-02-01,6.941,2.041,California,United States
71060,1849-03-01,9.731,2.294,California,United States
71061,1849-04-01,12.294,2.861,California,United States
71062,1849-05-01,14.417,2.215,California,United States

In [66]:
# Filter Date greater than 1991
df_weather_cali=df_weather_cali.loc[df_weather_cali["Date"] > "1991-12-01", :]
df_weather_cali.head()

,Date,AverageTemperature,AverageTemperatureUncertainty,State,Country
72774,1992-01-01,6.202,0.299,California,United States
72775,1992-02-01,9.780,0.300,California,United States
72776,1992-03-01,10.922,0.174,California,United States
72777,1992-04-01,15.266,0.233,California,United States
72778,1992-05-01,19.602,0.112,California,United States

In [67]:
df_weather_cali = df_weather_cali.replace({"California": "CA"})

In [68]:
#Change Date stamp to YYYYMM
df_weather_cali['dt'] = [''.join(x.split('-')[0:2]) for x in df_weather_cali['Date']]
df_weather_cali.head(15)

,Date,AverageTemperature,AverageTemperatureUncertainty,State,Country,dt
72774,1992-01-01,6.202,0.299,CA,United States,199201
72775,1992-02-01,9.780,0.300,CA,United States,199202
72776,1992-03-01,10.922,0.174,CA,United States,199203
72777,1992-04-01,15.266,0.233,CA,United States,199204
72778,1992-05-01,19.602,0.112,CA,United States,199205
72779,1992-06-01,20.762,0.287,CA,United States,199206
72780,1992-07-01,23.348,0.325,CA,United States,199207
72781,1992-08-01,24.536,0.327,CA,United States,199208
72782,1992-09-01,21.449,0.309,CA,United States,199209
72783,1992-10-01,16.929,0.129,CA,United States,199210
72784,1992-11-01,9.836,0.247,CA,United States,199211
72785,1992-12-01,4.691,0.404,CA,United States,199212
72786,1993-01-01,5.211,0.339,CA,United States,199301
72787,1993-02-01,6.972,0.306,CA,United States,199302
72788,1993-03-01,12.006,0.168,CA,United States,199303

In [69]:
df_weather_cali = df_weather_cali[[
             "dt", 
             "Date",
             "AverageTemperature", 
             "AverageTemperatureUncertainty", 
             "State", 
             "Country"]]
df_weather_cali.head()

,dt,Date,AverageTemperature,AverageTemperatureUncertainty,State,Country
72774,199201,1992-01-01,6.202,0.299,CA,United States
72775,199202,1992-02-01,9.780,0.300,CA,United States
72776,199203,1992-03-01,10.922,0.174,CA,United States
72777,199204,1992-04-01,15.266,0.233,CA,United States
72778,199205,1992-05-01,19.602,0.112,CA,United States

In [70]:
df_weather_cali = df_weather_cali.rename(
    columns={"AverageTemperature": "AverageTemperature_in_Celsius"})

In [71]:
# Convert the date column "dt" from a string to int64
df_weather_cali['dt'] = df_weather_cali['dt'].values.astype(np.int64)

In [72]:
table_name = 'weather'
df_weather_cali.to_sql(table_name, conn, index=False, if_exists='replace')

In [73]:
print(engine.table_names())

['fires', 'weather']

In [74]:
engine.execute('ALTER TABLE fires ALTER COLUMN "Fire_Date" TYPE Date USING "Fire_Date"::date')
engine.execute('ALTER TABLE weather ALTER COLUMN "Date" TYPE Date USING "Date"::date')

In [44]:
pd.read_sql_query('select f.fire date,f.cause description,f.fire name, w.averagetemperature in celsius from fires f inner join w weather on f.dt=w.dt',con=engine)

ProgrammingError: (psycopg2.errors.SyntaxError) syntax error at or near "name"
LINE 1: select f.fire date,f.cause description,f.fire name, w.averag...
                                                      ^

[SQL: select f.fire date,f.cause description,f.fire name, w.averagetemperature in celsius from fires f inner join w weather on f.dt=w.dt]
(Background on this error at: http://sqlalche.me/e/f405)